// Нужно сделать плоским словарь с вложенной структурой.
// Во входном объекте значением может быть строка или словарь.
// Ключ может быть пустой строкой. В этом случае его не нужно включать в название итогового ключа.

// /*
// {
//     "Key_1" : "1",
//     "Key_2" : {
//         "a" : "2",
//         "b" : "3",
//         "c" : {
//             "x" : "4",
//             "z" : {
//                 "" : "5"
//             }
//         }
//     }
// } =>
// {
//    "Key_1" : "1",
//    "Key_2.a" : "2",
//    "Key_2.b" : "3",
//    "Key_2.c.x" : "4",
//    "Key_2.c.z" : "5"
// }

// {
//     "": "1",
//     "": {
//         "":"1"
//     },
//     "b": "3"
// } =>
// {
//     "a":"1",
//     "b":"3"
// }
// */

// const flatten = (obj) => {
//     const res = {};
//     const fn = (o, prefix = "") => {
//         Object.entries(o).forEach(([key,val]) => {
//             if (typeof val === 'string') {
//                 let acckey = prefix ? `${prefix}.${key}` : key;
//                 if (!key && prefix) acckey = prefix;

//                 res[acckey] = val;
//             } else {
//                 fn(val, key);
//             }
//         })
//     }
//     return fn(obj);
// }

























